Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLabel Class
 The GridLabel class contains the grid labels of the grid lines, the text label and the insertion points.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GridLine.GridLabel
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class GridLabel : IAxisAlignedBoundingBox,
	IMovableRelative
<SerializableAttribute>
Public NotInheritable Class GridLabel
	Implements IAxisAlignedBoundingBox, IMovableRelative
The GridLine.GridLabel type exposes the following members.
Constructors
Name | Description
GridLine.GridLabel
 Creates a new default grid label instance.
Top
Properties
Name | Description
CenterPoint
 The center point of the grid label.
FrameHeight
 The height of the grid label frame.
FrameWidth
 The width of the grid label frame.
GridLabelPoint
 The grid line's label point. If the value of GridLabelPoint differs from the OffsetGridPoint value, a leader line will be created to the GridLabelPoint position. You can remove the leader line by setting GridLabelPoint to the GridPoint value (or by setting the GridLabelPoint anywhere on the grid line, but then the offset will change).
GridLabelText
 The grid line's label text.
GridPoint
 The grid line point, without offsets taken into consideration (model grid line coordinates).
OffsetGridPoint
 The grid line point where the grid line actually ends, with offsets applied.
TextHeight
 The height of the grid label's text frame.
TextWidth
 The width of the grid label's text frame.
Top
Methods
Name | Description
GetAxisAlignedBoundingBox
 The bounding box of the grid line label (rectangle format, axis aligned).
GetAxisAlignedBoundingBoxOfTextLabel
 The bounding box of the grid line label's text (rectangle format, axis aligned).
MoveObjectRelative
 Moves the object using the move vector.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace